{"vid":"359194","uid":"1806","title":"Colorado Bill To Review Juvenile Life Sentences Clears Committee","log":"Edited by nminor.","status":"1","comment":"0","promote":"0","sticky":"0","ds_switch":"","nid":"159013","type":"story","language":"und","created":"1461248735","changed":"1461250163","tnid":"0","translate":"0","revision_timestamp":"1461250163","revision_uid":"1806","body":{"und":[{"value":"<p>[[nid:151313 field_align=right]]Stories of heartache and loss filled a legislative committee room Wednesday, as lawmakers took up a bill that would give convicts who received lifetime sentences without parole as juveniles a chance at freedom.<\/p><p><a href=\"http:\/\/www.leg.state.co.us\/clics\/clics2016a\/csl.nsf\/fsbillcont3\/1BFAD4F5122CBF2087257F7A005FC725?Open&amp;file=181_01.pdf\" target=\"_blank\">The bill <\/a>would fulfill a lifelong wish of 22-year-old Davena Frazzini of Denver. Her father has been behind bars since he was convicted of murder at the age of 15. Frazzini said through tears that her father &ldquo;has missed 22 years of birthdays, holidays and celebrations,&rdquo;<\/p><p>&ldquo;We have never played on the swings in the park. And we have never had the chance to hold each other in times when we need each other the most,&rdquo; she said.<\/p><p>But families who lost loved ones to violent crimes also shared their emotional stories of loss. They included Gail Palone of the Eastern Plains town of Bennett. Her son Matthew was 16 when he was shot to death in 1996. She rattled off a rites of passage list that she will never check off.<\/p><p>&ldquo;No 18th birthday. No high school graduation. No college graduation. No wedding. No children. No grandchildren. That is what we have &ndash; nothing from age 16 on,&rdquo; she said.<\/p><p>The bill passed the Senate Judiciary committee by a bipartisan vote of 3-2 following a hearing that lasted more than four hours.<\/p><p>The bill would allow those who were sentenced to life without parole as juveniles during a particular time period an opportunity to request a hearing to modify their sentences. The legislation would apply to 48 youths who were sentenced to a class 1 felony between July 1, 1990 and July 1, 2006.<\/p><p>An amendment was added to a companion bill later in&nbsp;the evening that would make&nbsp;offenders who were convicted of a sex crime ineligible for resentencing consideration.<\/p><p>During the 1990s, Colorado enacted tough laws aimed at curbing spikes in violent crimes. They included life sentences without parole in cases involving juveniles who received adult convictions of first-degree murder. The state ended those sentences in 2006 after studies on juvenile brain development showed that youths are more prone to making mistakes and taking risks than adults.<\/p><p>&ldquo;It&rsquo;s because they&rsquo;re kids,&rdquo; said state Sen. Laura Woods, R-Westminster, who is a bill sponsor. &ldquo;They react and they think about the rewards more than the consequences. They&rsquo;re risk takers. They don&rsquo;t think through the long-term consequences of their behaviors.&rdquo;<\/p><p>In 2012, the U.S. Supreme Court struck down mandatory life sentences without parole for juveniles. And, earlier this year, the court ruled that juveniles who have received those sentences for murder convictions must but allowed the opportunity to argue their release from prison.<\/p><p>&ldquo;It&rsquo;s very clear what the Supreme Court decision has done,&rdquo; said Sen. Cheri Jahn, D-Wheat Ridge, who also sponsored the legislation. &ldquo;We do have to address that or it&rsquo;s going to be litigated again and again in court. They [Supreme Court justices]&nbsp;have said sending those juveniles to life without parole is unconstitutional.&rdquo;<\/p><p>The bill would give judges the opportunity to reexamine potentially mitigating circumstances at a resentencing hearing. Judges could take into account the offender&rsquo;s age and maturity level at the time of the crime, and whether the offender has a capacity to be rehabilitated. The judge would then be given a range of sentencing options<\/p><p>If a judge finds &ldquo;extraordinary mitigating circumstances,&rdquo; the court could restructure an offender&rsquo;s sentence to between 24 and 48 years in prison. Or a judge can re-impose a life sentence, with parole eligibility after serving 40 years behind bars, according to bill information provided by the Colorado Legislative Council.<\/p><p>The bill received stiff opposition from the Colorado District Attorneys&rsquo; Council. Prosecutors argued that violent offenders released early would be an injustice to victims&rsquo; families &ndash; and a danger to their communities.<\/p><p>Prosecutors brought up the case of Austin Sigg. Sigg was 17 when he kidnapped and killed 10-year-old Jessica Ridgeway in October 2012. Prosecutors expressed concern that the bill could allow Sigg to be released early. However, bill supporters say that Sigg, who is serving multiple sentences, won&rsquo;t be eligible for parole for at least another 90 years.<\/p><p>The bill must now heads to the Senate floor, where John Michael Leonardelli hopes it will die.<\/p><p>His father, also named John, was stabbed to death in an Aurora parking garage in 1994. He isn&rsquo;t swayed by the argument that a juvenile life without parole sentence constitutes a cruel and unusual punishment.<\/p><p>&ldquo;Is not the taking of a human life cruel and unusual punishment?&rdquo; said Leonardelli. &ldquo;How can the assailants be given that right when our loved ones who were murdered were never given that consideration?&rdquo;<\/p>","summary":"A Senate committee heard hours of stories of heartache and loss as they took up a bill that would give certain convicts a chance at freedom.","format":"full_html"}]},"field_author":{"und":[{"target_id":"130909"}]},"field_image":[],"field_audio":{"und":[{"target_id":"159014"}]},"field_video":[],"field_slideshow":[],"field_related_content":[],"field_topics":{"und":[{"target_id":"18864"}]},"field_story_type":[],"field_tags":{"und":[{"tid":"7623"},{"tid":"3922"}]},"field_feature_action_text":[],"field_feature_space_eligibility":{"und":[{"value":"1"}]},"field_secondary_services":[],"field_feature_image":{"und":[{"target_id":"151313"}]},"field_song_of_the_week":[],"field_primary_service":{"und":[{"target_id":"14"}]},"field_feature_supporting_copy":{"und":[{"value":"<p>A Senate committee heard hours of stories of heartache and loss as they took up a bill that would give certain convicts a chance at freedom.<\/p>","format":"full_html"}]},"field_npr_ingest_id":[],"field_popularity_radioactivity":[],"field_document":[],"field_google_editors_pick":{"und":[{"value":"0"}]},"field_google_news":{"und":[{"value":"1"}]},"field_google_news_genres":[],"field_npr_ingest_image2":[],"field_npr_audio":[],"field_push_to_npr_one":[],"field_push_to_npr":[],"_drafty_revision_requested":"FIELD_LOAD_CURRENT","metatags":{"und":{"robots":{"value":{"0":0,"index":0,"follow":0,"noindex":0,"nofollow":0,"noarchive":0,"nosnippet":0,"noodp":0,"noydir":0}}}},"path":{"pid":"294598","source":"node\/159013","alias":"news\/story\/colorado-bill-review-juvenile-life-sentences-clears-committee","language":"und","pathauto":"1"},"rdf_mapping":{"rdftype":["sioc:Item","foaf:Document"],"title":{"predicates":["dc:title"]},"created":{"predicates":["dc:date","dc:created"],"datatype":"xsd:dateTime","callback":"date_iso8601"},"changed":{"predicates":["dc:modified"],"datatype":"xsd:dateTime","callback":"date_iso8601"},"body":{"predicates":["content:encoded"]},"uid":{"predicates":["sioc:has_creator"],"type":"rel"},"name":{"predicates":["foaf:name"]},"comment_count":{"predicates":["sioc:num_replies"],"datatype":"xsd:integer"},"last_activity":{"predicates":["sioc:last_activity_date"],"datatype":"xsd:dateTime","callback":"date_iso8601"}},"name":"nminor","picture":"0","data":"b:0;","workbench_moderation":{"current":{"hid":"243403","vid":"359194","nid":"159013","from_state":"published","state":"published","uid":"1806","stamp":"1461250163","published":"1","is_current":1,"title":"Colorado Bill To Review Juvenile Life Sentences Clears Committee","timestamp":"1461250163"},"published":{"hid":"243403","vid":"359194","nid":"159013","from_state":"published","state":"published","uid":"1806","stamp":"1461250163","published":"1","is_current":1,"title":"Colorado Bill To Review Juvenile Life Sentences Clears Committee","timestamp":"1461250163"},"my_revision":{"hid":"243403","vid":"359194","nid":"159013","from_state":"published","state":"published","uid":"1806","stamp":"1461250163","published":"1","is_current":1,"title":"Colorado Bill To Review Juvenile Life Sentences Clears Committee","timestamp":"1461250163"}}}