{"vid":"410118","uid":"2630","title":"How Sen. Bennet Says He'd Make Health Care Cheaper And More Accessible","log":"Edited by jhill.","status":"1","comment":"0","promote":"0","sticky":"0","ds_switch":"","nid":"186474","type":"story","language":"und","created":"1500414020","changed":"1507058310","tnid":"0","translate":"0","revision_timestamp":"1507058310","revision_uid":"2845","body":{"und":[{"value":"<p>[[nid:184829 field_align=full-width]]Senate Republicans <a href=\"http:\/\/www.npr.org\/sections\/thetwo-way\/2017\/07\/17\/537803874\/gop-senators-come-out-against-republican-healthcare-bill-ensuring-it-cant-pass\">conceded defeat<\/a> on a health care reform bill Monday, then tried and quickly appeared to fail with a <a href=\"http:\/\/www.npr.org\/2017\/07\/18\/537921805\/mcconnell-backup-plan-to-repeal-affordable-care-act-falters\">different approach Tuesday<\/a>. Now, Democratic Sen. Michael Bennet of Colorado says it&#39;s time for bipartisan approach to fixing the existing Affordable Care Act.<\/p>\r\n\r\n<ul>\r\n\t<li><strong>NPR:<\/strong> <a href=\"http:\/\/www.npr.org\/2017\/07\/19\/537948116\/trumps-big-repeal-deal-8-thoughts-on-the-senate-s-meltdown-moment\">8 Takeaways On The Senate&#39;s Heath Care Meltdown Moment<\/a><\/li>\r\n<\/ul>\r\n\r\n<p>Bennet tells Colorado Matters he wants to increase competition among insurance companies. One way, he said, is to create strong markets by making sure that customer pools include a mix of healthy and sick patients so insurers can make money. Another possibility is a public option that would allow people to buy into Medicaid and Medicare programs. The program should also require the medical industry to provide more information about real costs to consumers, he said.<\/p>\r\n\r\n<p>&quot;If you don&#39;t know what a knee replacement costs, in every single hospital and [from] every single provider in Colorado or the Denver metro area, you can&#39;t make a good judgment.&quot;<\/p>\r\n\r\n<p>We&#39;ve asked Colorado&#39;s Republican Sen. Cory Gardner to join us to talk about health care, but he hasn&#39;t accepted.<\/p>\r\n\r\n<h3>Read The Transcript<\/h3>\r\n\r\n<table border=\"0\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:100%;\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t\t<p><strong>Ryan Warner:<\/strong> Sen. Bennet, welcome back to the program.<\/p>\r\n\r\n\t\t\t\t<p><strong>Sen. Michael Bennet:<\/strong> Thank you for letting me come back.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> Let&#39;s look at what&#39;s going on in Colorado under the Affordable Care Act, Obamacare, which remains the law of the land. Figures released last week show that people who buy on the individual market face a 27 percent premium increase next year. That is on top of a 20 percent increase last year. What needs to be fixed in the Affordable Care Act to avoid premium increases like that?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I think the first thing that would help would be to stop referring to our health care system as the Affordable Care Act. Our health care system is much bigger than that, it&#39;s much more complex than that. It has to do with Medicare, Medicaid, a private insurance market, doctors, nurses, people&#39;s health care itself. And I think that if Senators would begin to address the needs that their constituents have, including the kind of sticker shock that you&#39;re talking about, I think we could make progress by increasing more transparency, by increasing more competition by insurance providers. By giving people the chance to be able to know what they&#39;re buying when they pay for health care or pay for insurance. Unfortunately this has all become a political football about Obamacare or not Obamacare. My view is that whether you&#39;re a supporter of the Affordable Care Act or not in Colorado, in general, your intersection with our health care system is not a very positive experience.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> You talk about transparency and competition. Give me an example of one of those, a specific change that could be made.<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> Well I&#39;ll give you an example of two of those. The most common worry I hear in rural parts of Colorado is that there&#39;s only one insurer, or sometimes there&#39;s not even one insurer and we ought to fix that. We either ought to fix that by having a market that can sustain more than one insurer because of the way we draw the pools of people that will be insured, that is so that people can actually make a business of it. And if that can&#39;t work, then we should create other options like a public option for people, the ability to buy into Medicare or Medicaid. I mean I think those are all possibilities that would create competition.<\/p>\r\n\r\n\t\t\t\t<p>With respect to transparency, anybody who&#39;s had to care for a parent or care for a child or care for themselves knows that, unlike almost any other human endeavor, it&#39;s almost impossible to find out what anything costs, and that&#39;s something actually I&#39;ve been fighting for since the Affordable Care Act was passed.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> You talk about the lack of coverage in some parts of the state. Anthem, for instance, is the only carrier in 14 counties in the western part of the state. The company at one point was threatening to pull out of the state entirely until recently. I want to go back to this notion of a public option, perhaps expanding Medicaid or Medicare, allowing people to buy into those programs who don&#39;t currently qualify. Right now 20 percent of Coloradans are on Medicaid. The Republicans, of course, in their various plans have proposed big cuts to that program and at the same time giving states more say over how to use those dollars, but it sounds like you want to take it in the opposite direction.<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> Yeah. I am in the other direction because the direction they went in doesn&#39;t even represent where Republicans are in Colorado, much less our Democrats or Independents.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> What makes you think Coloradans want a public option, and maybe compare and contrast that a little bit with Single Payer, which failed at the ballot box.<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I think what they want is to be able to not have to make decisions that people all over the industrialized world do not have to make when it comes to health care. And how we get there, I think is up for debate and up for discussion, what the contours of it look like, but I do think the American people and people in Colorado are fed up with a health care system that doesn&#39;t support them or their families well.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> Get back to this public option for me. Do a little comparing and contrasting perhaps with the single payer model, which has been talked about a lot.<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> Well single payer option would be an option that there is no private insurance and where everybody is in the same plan. A public option, there are different ways you could design it, but I think in general what it is meant to do is provide competition to the private market and just give people an alternative they can choose to be in, if they want to be in or not.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> So where do you direct your energies? As a member of the minority party, is this just yelling into an empty chasm here?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I&#39;m not yelling at anybody.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> Yes. Talking into an empty chasm.<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I mean where I get my energy is from the Town Hall meetings and the other countless meetings I&#39;ve had around the state listening to people talk about their struggles with health care and where they see the opportunities. There&#39;s plenty of legislation that&#39;s pending in Congress, including bills that I have. For example, with Rob Portman is a Republican from Ohio that would change the way Medicare works so that we&#39;d focus our attention on people in Medicare that are the sickest 15 percent&nbsp;of patients that cost us 50 percent of our spending. There&#39;s a much better way of dealing with that than the way we&#39;re dealing with it today. I think that we&#39;ve gotta find a way to come together as Republicans and Democrats and address this issue. I am astonished that the President&#39;s reaction to the failure in the Senate is to say that he&#39;s going to &quot;Let Obamacare fail.&quot; That&#39;s just an utterly irresponsible position for him to take. He&#39;s been sabotaging the Bill ever since he became President and I guess he&#39;s going to continue to do that. That&#39;s not going to help Republicans or Democrats in Colorado afford health insurance.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> And yet Republicans won in large part on the message of repealing this law. They have a duty then, don&#39;t they, to fulfill that commitment to their constituents?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I think that now that they&#39;re governing, they have a duty to the American people. They can make their judgment about whether that requires a repeal or not. They voted to repeal Obamacare, I think it was 60 times in the House of Representatives when President Obama was President. They voted to repeal it in the Senate in 2015 and it actually went to the President, who vetoed it. Now they have the presidency, they have the Senate, they have the House of Representatives, and I think what they&#39;re discovering is that the empty rhetoric that they used to talk about the Affordable Care Act over the last eight years can&#39;t be matched by a legislative proposal that can pass with simply Republican votes, much less the way it should pass, which is with Republicans and Democrats.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> Do you think there&#39;s any room for shrinking Medicaid.<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I think it depends on what problem you&#39;re trying to solve. If your view of the world is the Federal Government should be less involved in health care, if that&#39;s your principal view of the world, I think you could then take the position, we should reduce Medicaid. The question then becomes I think, what to the people who are now on Medicaid.&nbsp; So the story that&#39;s told by some of the most zealous opponents of Medicaid and people that want to get rid of it to pay for tax cuts for the wealthiest 1 percent&nbsp;of Americans, are people that are saying there are a whole bunch of lazy people in states like Colorado who if they weren&#39;t on Medicaid would work and therefore could buy private insurance. That&#39;s just not true. What there are in Colorado, 50 percent or so of the people on Medicaid are children. A huge number of the people are in nursing homes so obviously can&#39;t work. They&#39;ve spent their entire life savings down for the privilege of being on Medicaid. And then shamefully, there are people working in the United States of America in the 21st Century who are working one or two jobs and cannot afford private insurance and therefore on Medicaid.<\/p>\r\n\r\n\t\t\t\t<p>So my view is if you want to reduce Medicaid, you ought to come with a plan to make private insurance more affordable for the people that are on Medicaid. You ought to come with a plan that can provide insurance to people in nursing homes who spent down their life savings. And you ought to tell us how we&#39;re going to cover poor children in this country that are now covered by Medicaid. And so what I hope happens is that rational people come to the table and have a conversation that actually reflects the values of people that live in states like Colorado. This is not about a science experiment. It&#39;s not about something that you read in your Ayn Rand novel when you were 16 years old. This is about the American people.&nbsp;<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> You&#39;ve talked about transparency which you presumably see as a way of maybe driving down cost if those figures are more transparent. But you know American health care is the most expensive in the world by far. In 2015 Americans spent $3.2 trillion on it. $10,000 for every man, woman, child. Given rising costs for drugs, hospital care, medical equipment, does transparency really make a dent?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> It would make a huge dent. If you don&#39;t have transparency you can&#39;t have a real market. If you don&#39;t know what a knee replacement costs at every single hospital and every single provider in Colorado or the Denver metro area, you can&#39;t make a good judgment. Time Magazine had a cover story three or four years ago about the way billing is done in hospitals and what it demonstrated was there&#39;s absolutely no rationalization, or rationale, at all for what charges they make. So is it sufficient? No. Is it necessary? Yes. I think that Medicare should be able to negotiate for drug prices. I think that would be another thing that would bring prices down.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> One provision of the current health care law that has run into a lot of heat is the mandate that business offer insurance. Small businesses say that the costs can be prohibitive and there&#39;s some evidence that businesses have gotten around that by reducing employee hours. Would you be willing to scrap that mandate?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I certainly would be willing to look at the way that it works in practice and I have heard employers say that they&#39;ve reduced hours in order to come under the threshold. That obviously is something that nobody would want. At least I wouldn&#39;t want. It&#39;s also true, I actually think the most legitimate criticism of the Affordable Care Act, now not the health care system generally, but of the Affordable Care Act is people that I meet in places like Rout County have said to me, &quot;Michael, look you&#39;re requiring me to buy health insurance but I make too much money to qualify for the subsidy and insurance is really expensive because there is insufficient competition in my county and the deductible is so high it&#39;s of no use to my family. Why would you force me to buy something that doesn&#39;t make sense?&quot;<\/p>\r\n\r\n\t\t\t\t<p>I think that is an excellent critique of legislation that I voted for and I would like to change that. I&#39;d like to look at the issues that you raise on small businesses as well. And if we had a functioning Congress, these are the kinds of things we&#39;d be working on together to try to improve our health care system.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> To another topic briefly. A Presidential Commission looking at possible voter fraud, this is a White House Commission, recently asked the states for some detailed information on voters. A Secretary of State here in Colorado Wayne Williams said he&#39;s willing to provide some of that information that the law already makes public. He has also suggested several reforms to the election process including a requirement that the federal government inform all state election officials if it finds vulnerabilities in the election security in any state. That kind of information sharing. You have called for this White House Commission on election fraud to simply disband but from Wayne Williams point of view, it may be able to broach some important issues. What do you say?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I know the spirit in which this commission was created. I sat in the White House and listened to the President of the United States, Donald Trump, claim that he would have won the State of New Hampshire if thousands of illegal voters hadn&#39;t been bused from what he called certain parts of Massachusetts to New Hampshire. That&#39;s simply not true. It did not happen. I believe this is a concerted effort on his part to try to drive down voter participation in this democracy. And the evidence of that is that over 4000 people in Colorado have unregistered from the voting rolls in the wake of the announcement of this Commission. I believe that is against everything that this republic stands for and I believe they should withdraw a Commission that set out to prove that a problem that does not exist, actually exists.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> It has borne out that many of those who withdrew their registration were predominantly Democrats and unaffiliated voters. Do you think that&#39;s an active protest or do you think they&#39;re actually concerned about their information which, by the way, Wayne Williams says is already public?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I think that the reason why you&#39;re seeing people do it is out of fear that somehow the federal government is going to misuse their voter data.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> How realistic is a bipartisan solution on health care? Is that a pipe dream?<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> I think it can&#39;t be a pipe dream because I think the only solution is one that will come from Republicans and Democrats working together. The Republicans have proven that they can&#39;t do it by themselves. And now, hopefully now, that Mitch McConnell has wasted six months of the American people&#39;s time, he now will come to his senses and allow Democrats to be able to work with him to try to produce a result. And if he does that I think he&#39;ll find that there are numbers of Democrats that have worked, for example as I have, with Rob Portman who&#39;s a Republican from Ohio, to produce fixes to our health care system most broadly understood and that that&#39;s how we ought to go forward.<\/p>\r\n\r\n\t\t\t\t<p><strong>RW:<\/strong> Sen. Bennett, thank you for being with us.<\/p>\r\n\r\n\t\t\t\t<p><strong>MB:<\/strong> Thanks for having me. I appreciate it.<\/p>\r\n\t\t\t<\/td>\r\n\t\t<\/tr>\r\n\t<\/tbody>\r\n<\/table>\r\n","summary":"As Republican health care proposals appear dead, Democratic Sen. Michael Bennet says he hears frequent complaints about the current law, and has ideas to fix it.","format":"full_html"}]},"field_author":{"und":[{"target_id":"159027"}]},"field_image":[],"field_audio":{"und":[{"target_id":"186483"}]},"field_video":[],"field_slideshow":[],"field_related_content":[],"field_topics":{"und":[{"target_id":"18863"}]},"field_story_type":{"und":[{"tid":"70"}]},"field_tags":{"und":[{"tid":"1319"},{"tid":"8894"},{"tid":"2232"},{"tid":"1968"}]},"field_feature_action_text":[],"field_feature_space_eligibility":{"und":[{"value":"1"}]},"field_secondary_services":[],"field_feature_image":{"und":[{"target_id":"184829"}]},"field_song_of_the_week":[],"field_primary_service":{"und":[{"target_id":"14"}]},"field_feature_supporting_copy":{"und":[{"value":"<p>As Republican health care proposals appear dead, Democratic Sen. Michael Bennet says he hears frequent complaints about the current law, and has ideas to fix it.<\/p>\r\n","format":"full_html"}]},"field_npr_ingest_id":[],"field_popularity_radioactivity":[],"field_document":[],"field_google_editors_pick":{"und":[{"value":"0"}]},"field_google_news":{"und":[{"value":"0"}]},"field_google_news_genres":[],"field_npr_ingest_image2":[],"field_npr_audio":{"und":[{"value":null,"title":"Audio: Ryan Warner speaks with Sen. Michael Bennet about healthcare reform","duration":"882","description":"","mp3":"https:\/\/www.cpr.org\/sites\/default\/files\/audio\/bennet_on_healthcare_editing-170718-174453.mp3","mediastream":"","wm":"","download":"1","stream":"1","embed":"1"}]},"field_push_to_npr_one":{"und":[{"value":"0"}]},"field_push_to_npr":{"und":[{"value":"0"}]},"_drafty_revision_requested":"FIELD_LOAD_CURRENT","path":{"pid":"325369","source":"node\/186474","alias":"news\/story\/sen-bennet-how-he-says-hed-make-healthcare-cheaper-and-more-accessible","language":"und","pathauto":"1"},"rdf_mapping":{"rdftype":["sioc:Item","foaf:Document"],"title":{"predicates":["dc:title"]},"created":{"predicates":["dc:date","dc:created"],"datatype":"xsd:dateTime","callback":"date_iso8601"},"changed":{"predicates":["dc:modified"],"datatype":"xsd:dateTime","callback":"date_iso8601"},"body":{"predicates":["content:encoded"]},"uid":{"predicates":["sioc:has_creator"],"type":"rel"},"name":{"predicates":["foaf:name"]},"comment_count":{"predicates":["sioc:num_replies"],"datatype":"xsd:integer"},"last_activity":{"predicates":["sioc:last_activity_date"],"datatype":"xsd:dateTime","callback":"date_iso8601"}},"name":"mfulcher","picture":"0","data":"b:0;","workbench_moderation":{"current":{"hid":"284598","vid":"410118","nid":"186474","from_state":"published","state":"published","uid":"2845","stamp":"1507058310","published":"1","is_current":1,"title":"How Sen. Bennet Says He'd Make Health Care Cheaper And More Accessible","timestamp":"1507058310"},"published":{"hid":"284598","vid":"410118","nid":"186474","from_state":"published","state":"published","uid":"2845","stamp":"1507058310","published":"1","is_current":1,"title":"How Sen. Bennet Says He'd Make Health Care Cheaper And More Accessible","timestamp":"1507058310"},"my_revision":{"hid":"284598","vid":"410118","nid":"186474","from_state":"published","state":"published","uid":"2845","stamp":"1507058310","published":"1","is_current":1,"title":"How Sen. Bennet Says He'd Make Health Care Cheaper And More Accessible","timestamp":"1507058310"}}}