{"vid":"453700","uid":"2845","title":"Denver’s Tiny Homeless Village Still Faces Challenges, But Year One Was A Win-Win","log":"Edited by jhill.","status":"1","comment":"0","promote":"0","sticky":"0","ds_switch":"","nid":"209894","type":"story","language":"und","created":"1534932000","changed":"1534944298","tnid":"0","translate":"0","revision_timestamp":"1534944298","revision_uid":"2845","body":{"und":[{"value":"<p>[[nid:209891 field_align=full-width]]Tucked away on a lot on the edge of RiNo between a brewery and a commuter rail station is a thriving village for Denver&rsquo;s chronically homeless. The weather isn&rsquo;t cooperating on this day, but that isn&rsquo;t putting a damper on the potluck at the Beloved Community Village.<\/p>\r\n\r\n<p>It&rsquo;s an anniversary of sorts. This time last year, everyone was just settling into the tiny home hamlet built to house the homeless. Now, they&rsquo;re here celebrating their progress and looking to what&rsquo;s next.<\/p>\r\n\r\n<p>&ldquo;I told myself I would never move into a tiny home,&rdquo; laughed Ray Lyall. &ldquo;I built these, I did a lot of work on this stuff, I&rsquo;ve been doing it for five and a half years.&rdquo;<\/p>\r\n\r\n<p>Lyall hasn&rsquo;t forgotten about the 2015 raid of a prototype tiny village he and others had built a few blocks from here in the nearby Curtis Park neighborhood. He was one of 10 people arrested that day. After that, <a href=\"https:\/\/www.westword.com\/news\/tiny-houses-project-at-sustainability-park-raided-by-cops-ten-arrested-7283738\">advocates said<\/a> officers undertook &ldquo;the destruction and removal of several tiny homes which the group had constructed for houseless community members to live in.&rdquo; That was about the time Lyall decided he didn&rsquo;t want to live in a tiny house anymore. But that was long before he met his wife.<\/p>\r\n\r\n<p>&ldquo;I came to a village council and my wife was trying to get into one, and I said, &lsquo;this is perfect for her, why not let her in,&rsquo; and I think I fell in love with her right after that,&rdquo; he said. &ldquo;And a couple months later, we got married.&rdquo;<\/p>\r\n\r\n<p>The village council is all part of the village&rsquo;s system of <a href=\"https:\/\/belovedcommunityvillage.wordpress.com\/governance\/\">self-governance<\/a>. The only rules here are those created by villagers themselves. There&rsquo;s no curfew, like most homeless shelters have. Couples and pets are allowed, unlike most homeless shelters. There are communal bathrooms, and the large meeting place in the middle of 11 small, austere houses. Behind the community building are two small container gardens, the farthest one with a hand-painted sign that says &ldquo;Margaritaville.&rdquo; The whole village is surrounded by a colorful privacy fence.<\/p>\r\n\r\n<p>[[nid:209893 field_align=full-width]]<\/p>\r\n\r\n<p>For Amanda Lyall, Ray&rsquo;s wife, &ldquo;community&rdquo; isn&rsquo;t just a word in the name. It&rsquo;s the key to what makes this place tick.<\/p>\r\n\r\n<p>&ldquo;When I came in here, there were two different residents that made me their emergency contact, I would go to doctors appointments with them, help them get their prescriptions and help them set up their resource navigation and everything,&rdquo; she said. &ldquo;It gives not just me, but the other people here too, it gives us all a family that we haven&rsquo;t had in a long time.&rdquo;<\/p>\r\n\r\n<p>Amanda said success is hard to measure because it&rsquo;s different for everyone here. Organizers with the <a href=\"https:\/\/www.coloradovillagecollaborative.org\/\">Colorado Village Collaborative<\/a> &mdash; the nonprofit behind the project &mdash; let villagers define success for themselves. In the meantime, they have a safe place to stay, a door they can lock and people to look out for them.<\/p>\r\n\r\n<p>In the past year, Amanda Lyall has taken on work with two different nonprofits, volunteering for homelessness-related causes when she can. She&rsquo;s also taken on myriad responsibilities in the village like overseeing the communal cellphone or helping organize events like the celebratory potluck. Lyall is getting ready to move onto more permanent housing in about a month. She was approved for subsidized housing for women, which means Ray will stay behind. While she admits that leaving this place will be bittersweet, it&rsquo;s for a good reason.<\/p>\r\n\r\n<p>&ldquo;I have a daughter that I want back. She&rsquo;s my whole entire world and I need her back,&rdquo; Amanda said, her voice cracking. &ldquo;She&rsquo;s great motivation, she&rsquo;s the reason it&rsquo;s hard to wake up in the morning, because it&rsquo;s hard to breathe without her, but she&rsquo;s the reason that I absolutely must, and have to keep going.&rdquo;<\/p>\r\n\r\n<p>The Colorado Village Collaborative was founded by members of Beloved Mennonite Church and Denver Homeless Out Loud, along with architects, engineers and urban planners who donate their time. But Cole Chandler, who works as a facilitator with the group, said they can&rsquo;t take full credit.<\/p>\r\n\r\n<p>&ldquo;People on the streets came up with the concept, they helped develop it, they helped push for it in the city for years, and others of us joined on the project to provide some stability to it as it continued to move forward,&rdquo; he said.<\/p>\r\n\r\n<p>[[nid:209892 field_align=full-width]]<\/p>\r\n\r\n<p>The community around RiNO and Five Points embraced the project. Neighbors were even invited to the potluck.<\/p>\r\n\r\n<p>&ldquo;This project has actually been able to demonstrate that tiny home villages make good neighbors, that tiny home villages are an asset to a community,&rdquo; he said.<\/p>\r\n\r\n<p>There&rsquo;s now research to back that up. The University of Denver Burnes Center on Poverty and Homelessness <a href=\"https:\/\/www.bartoninstitute.org\/tiny-homes\">tracked the progress<\/a> of the Beloved Community Village and found very little effect on crime in the area. Nearly 80 percent of neighbors surveyed saw no negative impact on traffic, safety or noise. Closer to 90 percent say there was no negative impact on their sense of community.<\/p>\r\n\r\n<p>&ldquo;We randomly knocked on doors, and residents overwhelmingly either said &lsquo;oh, that exists?&rsquo;&rdquo; said Daniel Brisson, executive director of the Burnes Center &ldquo;Or they said: &lsquo;I&rsquo;m really glad it&rsquo;s here, yeah I heard about it, I walk by, it&rsquo;s surprisingly clean, it&rsquo;s surprisingly quiet, everyone seems to be asleep all the time.&rdquo;<\/p>\r\n\r\n<p>Brisson would like to continue to keep tabs on villagers&rsquo; progress in the future. The evaluation showed 10 of the original 12 villagers still lived there, nine months after first moving in. Three have moved into permanent housing and made space for new villagers, all of whom must be voted in. At the end of the evaluation period, every villager was either employed or in school, save for one who was receiving disability benefits.<\/p>\r\n\r\n<p>&ldquo;We thought long and hard about using the word &lsquo;success&rsquo; in our evaluation results, and ultimately we landed on using that word, &lsquo;success,&rsquo;&rdquo; Brisson said. &ldquo;It&rsquo;s really, really hard for me to interpret the findings of our evaluation without saying that this initiative is successful. The abundance of indicators show that it was a success.&rdquo;<\/p>\r\n\r\n<p>CVC is planning to open another tiny home village at the end of the year, specifically for homeless women and transgender people. And around that time, Beloved Community Village will be moving, and <a href=\"https:\/\/www.westword.com\/news\/rinos-beloved-community-tiny-home-village-to-relocate-9751098\">not for the first time<\/a>. Ironically, the lot at 38th and Blake is destined to become an apartment building, so the search is on for another location.<\/p>\r\n","summary":"The Beloved Community Village has been able to show that, \"tiny home villages are an asset to a community.\" Now a year later after their start, there's research to back that up.","format":"full_html"}]},"field_author":{"und":[{"target_id":"185036"}]},"field_image":[],"field_audio":{"und":[{"target_id":"209915"}]},"field_video":[],"field_slideshow":[],"field_related_content":{"und":[{"target_id":"209518"},{"target_id":"205432"},{"target_id":"206788"},{"target_id":"205598"}]},"field_topics":{"und":[{"target_id":"202899"}]},"field_story_type":[],"field_tags":{"und":[{"tid":"4590"},{"tid":"6984"},{"tid":"3729"},{"tid":"3514"},{"tid":"2136"},{"tid":"5069"},{"tid":"1355"},{"tid":"6205"},{"tid":"1893"}]},"field_feature_action_text":[],"field_feature_space_eligibility":{"und":[{"value":"1"}]},"field_secondary_services":[],"field_feature_image":{"und":[{"target_id":"209891"}]},"field_song_of_the_week":[],"field_primary_service":{"und":[{"target_id":"14"}]},"field_feature_supporting_copy":{"und":[{"value":"<p>The Beloved Community Village has been able to show that, &quot;tiny home villages are an asset to a community.&quot; Now a year later after their start, there&#39;s research to back that up.<\/p>\r\n","format":"full_html"}]},"field_npr_ingest_id":{"und":[{"value":"640842452","format":null,"safe_value":"640842452"}]},"field_popularity_radioactivity":[],"field_document":{"und":[{"target_id":"209892"}]},"field_google_editors_pick":{"und":[{"value":"0"}]},"field_google_news":{"und":[{"value":"1"}]},"field_google_news_genres":[],"field_npr_ingest_image2":[],"field_npr_audio":{"und":[{"value":null,"title":"Audio: Beloved Community Village reflects on year one, Ann Marie Awad reports","duration":"268","description":"","mp3":"https:\/\/www.cpr.org\/sites\/default\/files\/audio\/cpr-aawad_tiny-homeless-village_08222018-180822-72339.mp3","mediastream":"","wm":"","download":"1","stream":"1","embed":"1"}]},"field_push_to_npr_one":{"und":[{"value":"1"}]},"field_push_to_npr":{"und":[{"value":"1"}]},"_drafty_revision_requested":"FIELD_LOAD_CURRENT","path":{"pid":"349429","source":"node\/209894","alias":"news\/story\/denver-s-tiny-homeless-village-still-faces-challenges-but-year-one-was-a-win-win","language":"und","pathauto":"1"},"rdf_mapping":{"rdftype":["sioc:Item","foaf:Document"],"title":{"predicates":["dc:title"]},"created":{"predicates":["dc:date","dc:created"],"datatype":"xsd:dateTime","callback":"date_iso8601"},"changed":{"predicates":["dc:modified"],"datatype":"xsd:dateTime","callback":"date_iso8601"},"body":{"predicates":["content:encoded"]},"uid":{"predicates":["sioc:has_creator"],"type":"rel"},"name":{"predicates":["foaf:name"]},"comment_count":{"predicates":["sioc:num_replies"],"datatype":"xsd:integer"},"last_activity":{"predicates":["sioc:last_activity_date"],"datatype":"xsd:dateTime","callback":"date_iso8601"}},"name":"jhill","picture":"0","data":"b:0;","workbench_moderation":{"current":{"hid":"307509","vid":"453700","nid":"209894","from_state":"published","state":"published","uid":"2845","stamp":"1534944298","published":"1","is_current":1,"title":"Denver’s Tiny Homeless Village Still Faces Challenges, But Year One Was A Win-Win","timestamp":"1534944298"},"published":{"hid":"307509","vid":"453700","nid":"209894","from_state":"published","state":"published","uid":"2845","stamp":"1534944298","published":"1","is_current":1,"title":"Denver’s Tiny Homeless Village Still Faces Challenges, But Year One Was A Win-Win","timestamp":"1534944298"},"my_revision":{"hid":"307509","vid":"453700","nid":"209894","from_state":"published","state":"published","uid":"2845","stamp":"1534944298","published":"1","is_current":1,"title":"Denver’s Tiny Homeless Village Still Faces Challenges, But Year One Was A Win-Win","timestamp":"1534944298"}}}